In [1]:
import pandas as pd
import numpy as np

In [3]:
churn = pd.read_csv('churn.csv')

In [4]:
churn.head()

,Unnamed: 0,CreditScore,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Gender_int,Geography_France,Geography_Germany,Geography_Spain
0,0,619,Female,42,2,0.00,1,1,1,101348.88,1,1,1,0,0
1,1,608,Female,41,1,83807.86,1,0,1,112542.58,0,1,0,0,1
2,2,502,Female,42,8,159660.80,3,1,0,113931.57,1,1,1,0,0
3,3,699,Female,39,1,0.00,2,0,0,93826.63,0,1,1,0,0
4,4,850,Female,43,2,125510.82,1,1,1,79084.10,0,1,0,0,1

In [6]:
X = churn.select_dtypes('number')
X

,Unnamed: 0,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Gender_int,Geography_France,Geography_Germany,Geography_Spain
0,0,619,42,2,0.00,1,1,1,101348.88,1,1,1,0,0
1,1,608,41,1,83807.86,1,0,1,112542.58,0,1,0,0,1
2,2,502,42,8,159660.80,3,1,0,113931.57,1,1,1,0,0
3,3,699,39,1,0.00,2,0,0,93826.63,0,1,1,0,0
4,4,850,43,2,125510.82,1,1,1,79084.10,0,1,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,9995,771,39,5,0.00,2,1,0,96270.64,0,0,1,0,0
9996,9996,516,35,10,57369.61,1,1,1,101699.77,0,0,1,0,0
9997,9997,709,36,7,0.00,1,0,1,42085.58,1,1,1,0,0
9998,9998,772,42,3,75075.31,2,1,0,92888.52,1,0,0,1,0
9999,9999,792,28,4,130142.79,1,1,0,38190.78,0,1,1,0,0

In [7]:
y = churn.Exited
y.head()

0    1
1    0
2    1
3    0
4    0
Name: Exited, dtype: int64

In [8]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, random_state = 1)

In [9]:
print(X_train.shape)
print(y_train.shape)
print(X_test.shape)
print(y_test.shape)

(7500, 14)
(7500,)
(2500, 14)
(2500,)

In [11]:
# import the class
from sklearn.linear_model import LogisticRegression
#instantiate the model (using the default parameters)
logreg = LogisticRegression().fit(X, y)

In [12]:
logreg.fit(X, y)

LogisticRegression()

In [14]:
logreg.score(X, y)

0.7889

In [15]:
y_pred = logreg.predict(X)

In [16]:
y_pred

array([0, 0, 0, ..., 0, 0, 0])